Repository: jpaezsa/zym
Catalog: demo/data/locale/*/validate.po
Languages: nb, nl

# notAlnum
source: Value must be alphanumeric
nb: Verdi kan bare bestå av alfanumeriske tegn
nl: "%value%" bevat niet-alphabetische of niet-numerieke karakters

# stringEmpty
source: Cannot be an empty string
nb: Kan ikke ha en tom streng
nl: "%value%" is leeg een lege string

# notAlpha
source: Value must consist of only alphabetic characters
nb: Verdien kan bare bestå av alfabetiske tegn
nl: "%value%" heeft niet-alphabetische karakters

# notBetween
source: Value must be between "%min%" and "%max%", inclusively
nb: Verdi må være mellom "%min%" og "%max%", inklusivt
nl: "%value%" is geen getal van "%min%" tot en met "%max%"

# notBetweenStrict
source: Value must be strictly between "%min%" and "%max%"
nb: Verdi må være mellom "%min%" og "%max%", eksklusivt
nl: "%value%" is geen getal tussen de "%min%" en "%max%"

# ccnumLength
source: Value must contain between 13 and 19 digits
nb: "%value%" må være mellom 13 og 19 tegn
nl: "%value%" moet tussen de 13 en 19 karakters bevatten

# ccnumChecksum
source: Luhn algorithm (mod-10 checksum) failed
nb: Luhn algorithm (mod-10 checksum) feilet på "%value%"
nl: Luhn algoritme (mod-10 checksum) niet succesvol op "%value%"

# dateNotYYYY-MM-DD
source: Date must be in YYYY-MM-DD format
nb: "%value%" er ikke på formatet ÅÅÅÅ-MM-DD
nl: "%value%" is niet in het YYYY-MM-DD formaat

# dateInvalid
source: "%value%" does not appear to be a valid date
nb: "%value%" ser ikke ut til å være en gyldig dato
nl: "%value%" is geen geldige datum

# dateFalseFormat
source: "%value%" does not fit given date format
nb: "%value%" passer ikke det gitte datoformatet
nl: "%value%" voldoet niet aan het gegeven datum formaat

# notDigits
source: Value must be a number
nb: "%value%" inneholder ikke-numeriske tegn
nl: "%value%" bevat niet-numerieke karakters

# emailAddressInvalid
source: "%value%" does not appear to be a valid email address
nb: "%value%" er ikke en gyldig epost-adresse på formatet lokal-del@vertsnavn
nl: "%value%" is geen geldig email adres met het formaat local-part@hostname

# emailAddressInvalidHostname
source: "%hostname%" is not a valid hostname for email address "%value%"
nb: "%hostname%" er ikke et gyldig vertsnavn for epost-adressen "%value%"
nl: "%hostname%" is een ongeldige hostname voor het email adres "%value%"

# emailAddressInvalidMxRecord
source: "%hostname%" does not appear to have a valid MX record for the email address "%value%"
nb: "%hostname%" ser ikke ut til å ha et gyldig MX-record for epost-adressen "%value%"
nl: "%hostname%" lijkt geen geldig MX record te hebben voor het email adres "%value%"

# emailAddressDotAtom
source: "%localPart%" does not match against the dot-atom format
nb: "%localPart%" matcher ikke formatet "dot-atom"
nl: "%localPart%" kan niet gematched worden tegen het dot-atom formaat

# emailAddressQuotedString
source: "%localPart%" does not match against the quoted-string format
nb: "%localPart%" matcher ikke formatet "quoted-string"
nl: "%localPart%" kan niet gematched worden tegen het quoted-string formaat

# emailAddressInvalidLocalPart
source: "%localPart%" is not a valid local part for email address "%value%"
nb: "%localPart%" er en ugyldig lokal-del for epost-adressen "%value%"
nl: "%localPart%" is een ongeldig local gedeelte voor het email address "%value%"

# notFloat
source: Value must be a float or decimal
nb: "%value%" ser ikke ut til å være et flyttall
nl: "%value%" is geen kommagetal

# notGreaterThan
source: Value must be greater than "%min%"
nb: Verdi må være minst "%min%"
nl: "%value%" is niet groter dan "%min%"

# notHex
source: Value must be hexadecimal
nb: "%value%" inneholder ikke-hexadesimale tegn
nl: "%value%" bevat niet-hexadecimale karakters

# hostnameIpAddressNotAllowed
source: Value appears to be an IP address, but IP addresses are not allowed
nb: "%value%" ser ut til å være en IP-adresse, men IP-adresser er ikke tillatt
nl: "%value%" lijkt een IP adres te zijn, maar IP adressen zijn niet toegestaan

# hostnameUnknownTld
source: "%value%" appears to be a DNS hostname but cannot match the TLD against our known list
nb: "%value%" ser ut til å være et DNS-vertsnavn, men TLD matcher ikke listen med kjente TLD
nl: "%value%" lijkt een DNS hostname te zijn, maar kan het TLD niet verifieren

# hostnameDashCharacter
source: "%value%" appears to be a DNS hostname but contains a dash (-) in an invalid position
nb: "%value%" ser ut til å være et DNS-vertsnavn, men inneholder en strek (-) på en gyldig posisjon
nl: "%value%" lijkt een DNS hostname te zijn, maar bevat een streep (-) op een ongeldige positie

# hostnameInvalidHostnameSchema
source: "%value%" appears to be a DNS hostname but cannot match against hostname schema for TLD "%tld%"
nb: "%value%" ser ut til å være et DNS-vertsnavn, men matcher ikke skjema for TLD "%tld%"
nl: "%value%" lijkt een DNS hostname te zijn, maar kan de hostname niet valideren met het TLD schema "%tld%"

# hostnameUndecipherableTld
source: "%value%" appears to be a DNS hostname but cannot extract TLD part
nb: "%value%" ser ut til å være et DNS-vertsnavn, men kan ikke hente ut TLD
nl: "%value%" lijkt een DNS hostname te zijn, maar de TLD gedeelte kan niet gelezen worden

# hostnameInvalidHostname
source: "%value%" does not match the expected structure for a DNS hostname
nb: "%value%" ser ikke ut til å være et gyldig DNS-vertsnavn
nl: "%value%" komt niet overeen met de verwachte structuur voor een DNS hostname

# hostnameInvalidLocalName
source: Value does not appear to be a valid local network name
nb: "%value%" ser ikke ut til å være et gyldig vertsnavn for lokalnettverk
nl: "%value%" lijkt geen geldige lokale netwerk naam te zijn

# hostnameLocalNameNotAllowed
source: "%value%" appears to be a local network name but local network names are not allowed
nb: "%value%" ser ut til å være et lokalt vertsnavn, men lokale vertsnavn er ikke tillatt
nl: "%value%" lijkt een lokale netwerk naam te zijn, maar deze zijn niet toegestaan

# notSame
source: Values are not the same
nb: Verdier må være like
nl: Waardes zijn niet gelijk

# missingToken
source: No token was provided to match against
nb: Det er ikke gitt noen tegn å matche mot
nl: Er is geen teken opgegeven waarmee een vergelijken gemaakt kan worden

# notInArray
source: "%value%" was not found in the collection
nb: "%value%" ble ikke funnet i samlingen
nl: "%value%" was niet in de lijst gevonden

# notInt
source: Value must be an integer
nb: "%value%" ser ikke ut til å være et heltall
nl: "%value%" lijkt geen geheel getal te zijn

# notIpAddress
source: Value does not appear to be a valid IP address
nb: "%value%" ser ikke ut til å være en gyldig IP-adresse
nl: "%value%" lijkt geen geldig IP adres te zijn

# notLessThan
source: Value must be less than "%max%"
nb: "%value%" må være mindre enn "%max%"
nl: "%value%" is niet minder dan "%max%"

# isEmpty
source: Value cannot be empty
nb: Kan ikke ha tom verdi
nl: Er is geen waarde gegeven, terwijl dit wel verplicht is

# regexNotMatched
source: "%value%" does not match against pattern "%pattern%"
nb: "%value%" matcher ikke mønsteret "%pattern%"
nl: "%value%" komt niet overeen met het patroon "%pattern%"

# stringLengthTooShort
source: Value must be more than %min% characters
nb: "%value%" må være minst %min% tegn
nl: "%value%" is minder dan %min% karakters lang

# stringLengthTooLong
source: Value must be shorter than %max% characters
nb: "%value%" kan ikke være mer enn %max% tegn
nl: "%value%" is langer dan %max% karakters lang
